Revit 2027 API
IFCExtrusionCalculatorUtils.CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList<Face>) Method
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<IFCExtrusionData> CalculateExtrusionData(
	IFCExtrusionCalculatorOptions extrInfo,
	IList<Face> allInputFaces
)
Public Shared Function CalculateExtrusionData (
	extrInfo As IFCExtrusionCalculatorOptions,
	allInputFaces As IList(Of Face)
) As IList(Of IFCExtrusionData)
public:
static IList<IFCExtrusionData^>^ CalculateExtrusionData(
	IFCExtrusionCalculatorOptions^ extrInfo,
	IList<Face^>^ allInputFaces
)
static member CalculateExtrusionData :
        extrInfo : IFCExtrusionCalculatorOptions *
        allInputFaces : IList<Face> -> IList<IFCExtrusionData>
Parameters
extrInfo IFCExtrusionCalculatorOptions
allInputFaces IList<Face>
Return Value
IList<IFCExtrusionData>
See Also
Reference
IFCExtrusionCalculatorUtils Class
CalculateExtrusionData Overload
Autodesk.Revit.DB.IFC Namespace